intersectSurfacesThroughPoint(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,TessEpsCntrl!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,Owner&lt;GCurve&gt;*,System.Double*,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*)
Find the intersection curve for two surfaces that passes through a given point
(to within the vertex tolerance specified by tessEpsCntrl).
Optional output pCurveParam is set to the parameter of the input point on the
intersection curve. bOnlyAnalytical has the same meaning as in intersectSurfaces.
An error is returned if there is no such curve, or if there is more than one
such curve. This is a convenience wrapper around intersectSurfaces.